import defaultBg from '@/assets/images/timeline/defaultBg.jpg'
const timelineData = {
    title:'时间线',
    subtitle:'记录开发进度',
    cards: [
        {
            title: '时间线组件实现',
            img: defaultBg,
            desc: '新增TimeLine组件,用于记录日志',
            date: '2024-11-06',
        },
        {
            title: '听歌识曲功能实现及引入第三方库',
            img: defaultBg,
            desc: '新增SRPC的hooks(第三方),用于Python与JavaScript平台间的消息互通;新增"听歌识曲"相关API接口和功能实现。',
            date: '2024-11-05',
        },
        {
            title: '优化右键菜单逻辑及音乐播放逻辑',
            img: defaultBg,
            desc: '新增组件PlaylistFrom并暴露窗口显示函数,用于服务功能"歌单创建/修改"并删除相关原有冗余代码;修改右键菜单样式并优化其动画执行方式,避免第一次加载带来的边界判断问题;优化音乐播放逻辑,集成"播放/暂停"、"上一首/下一首"和"模式切换"功能。',
            date: '2024-11-04',
        },
        {
            title: '添加至歌单功能相关优化',
            img: defaultBg,
            desc: '新增本地歌单卡片渲染,可以新增和删除歌单,新增本地卡片的右键菜单;新增组件PlayListDialog并暴露窗口显示和设置待选音乐函数,用于服务功能"添加至歌单"并删除相关原有冗余代码;新增当前播放列表歌曲删除功能;修复当前播放列表为空时,歌词滚动引发的问题;优化音乐切换时,相关网络请求的次数。',
            date: '2024-11-03',
        },
        {
            title: '本地列表的初步实现',
            img: defaultBg,
            desc: '新增本地歌单卡片渲染,可以新增和删除歌单,新增本地卡片的右键菜单;新增编辑本地歌单detail,修复登陆状态失效时,推荐歌单(需要登录)与发现歌单都不加载的问题;新增音乐(歌单和搜索)添加至本地歌单,搜索页新增返回至顶部;新增删除本地歌单的音乐;Message组件更新样式,新增类型图标使提示更加明显;修复当前播放列表进行拖动排序时,影响到currentIndex的问题;新增点击歌词跳转进度,新增歌词滚轮滚动(有对应的防抖节流处理,回流操作只涉及到第一次初始化)',
            date: '2024-11-01',
        },
        {
            title: '组件更新及指令新增',
            img: defaultBg,
            desc: 'SwitchBtn.vue新增自定义宽高和颜色(css颜色)并且新增禁用和动态样式;我的歌单新增登陆判断;新增当前音乐列表的拖动排序并封装成指令。',
            date: '2024-10-13',
        },
        {
            title: '较大更新',
            img: defaultBg,
            desc: '搜素页面样式实现,新增点击歌曲播放,添加至下一首,新增下滑加载数据;修复懒加载在切换资源时失效的问题;歌单详情新增了数据分类显示,input的input事件取消防抖(输入法不同步问题)改为搜索建议使用防抖;封装tooltip组件(hover显示tip提示);修复dialog的动画问题,新增我的歌单路由,修复音乐详情右键对应元素时不显示菜单;新增用户歌单接口并写好相关文档;我的歌单页面简单实现瀑布流',
            date: '2024-10-06',
        },
        {
            title: '搜索功能实现',
            img: defaultBg,
            desc: 'Input组件新增搜索类型选择,并且排除Search组件的缓存,新增音乐搜索相关Api和文档',
            date: '2024-09-30',
        },
        {
            title: '搜索建议功能实现',
            img: defaultBg,
            desc: 'Input组件新增搜索建议功能,新增相关Api接口',
            date: '2024-09-29',
        },
        {
            title: '右键菜单问题修复等',
            img: defaultBg,
            desc: '修复右键菜单第一次点击会溢出宽高的问题;新增音乐列表右键菜单并加入列表isShow的白名单;新增点击track的节流;修复切换同一首歌重复请求评论接口的问题',
            date: '2024-09-28',
        },
        {
            title: '项目结构优化等其它更新',
            img: defaultBg,
            desc: '优化项目的组件结构,解决了评论组件多个实例下拉加载的问题,将不同实例内的io用ref对象包装,不存在多实例共用一个io的问题,然后对不同的加载动画做id命区分。封装了vlazy,用在评论组件上,现在用户头像懒加载了,解决大批量img请求带来的网络拥堵和渲染卡顿的问题',
            date: '2024-09-28',
        },
        {
            title: '评论组件复用实现及异常修复',
            img: defaultBg,
            desc: '评论组件可复用,解决一些同名idDom带来的数据异常,新增歌单评论',
            date: '2024-09-27',
        },
        {
            title: '评论功能新增及优化',
            img: defaultBg,
            desc: '评论区相关功能添加及优化,目前顶层评论可以加载更多,子评论明天再做(懒',
            date: '2024-09-26',
        },
        {
            title: '评论组件创建',
            img: defaultBg,
            desc: '评论组件完成(没优化,可能有些逻辑小bug)',
            date: '2024-09-23',
        },
        {
            title: '项目上传',
            img: defaultBg,
            desc: '上传初具规模的项目',
            date: '2024-09-18',
        }
    ]
}
export default timelineData